
#Область ОбработчикиСобытийЭлементовТаблицыФормыВыплаты

&НаКлиенте
Процедура ВыплатыСотрудникПриИзменении(Элемент)
	ДанныеТекСтроки = Элементы.Выплаты.ТекущиеДанные;
	СуммаВыплаты = ПолучитьОстатокДляВыплатыНаСервере(ДанныеТекСтроки.Сотрудник);
	ДанныеТекСтроки.Сумма = СуммаВыплаты;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьОстатокДляВыплатыНаСервере(Сотрудник)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
				   |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
				   |ИЗ
				   |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, Сотрудник = &Сотрудник) КАК
				   |		ВКМ_ВзаиморасчетыССотрудникамиОстатки";

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", Объект.Дата);

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Сумма;

КонецФункции

#КонецОбласти