#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УсловноеОформлениеТаблицы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УсловноеОформлениеТаблицы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ГрафикОтпусков(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Год", Объект.Год);
	СтруктураПараметров.Вставить("ОтпускаСотрудников", Объект.ОтпускаСотрудников);
	
	АдресВХ = ПоместитьВоВременноеХранилище(СтруктураПараметров, УникальныйИдентификатор);
	
	ПараметрыФормы = Новый Структура("АдресВХ", АдресВХ);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УсловноеОформлениеТаблицы()

	Для Каждого СтрокаТаблицы Из Объект.ОтпускаСотрудников Цикл

		ПараметрыОтбора = Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник);
		НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(ПараметрыОтбора);

		ДнейОтпуска = 0;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ДнейОтпуска = ДнейОтпуска + Окр((КонецДня(НайденнаяСтрока.ДатаОкончания) - НачалоДня(
				НайденнаяСтрока.ДатаНачала)) / 60 / 60 / 24);
		КонецЦикла;

		Если ДнейОтпуска > 28 Тогда
			ПодсветитьСтрокуТаблицы(СтрокаТаблицы.Сотрудник, Истина);
		Иначе
			ПодсветитьСтрокуТаблицы(СтрокаТаблицы.Сотрудник, Ложь);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПодсветитьСтрокуТаблицы(Сотрудник, Подсветить)

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();

	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	элементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник"); 
	элементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	элементОтбора.ПравоеЗначение = Сотрудник;
	элементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ?(Подсветить, WebЦвета.Красный, ЦветаСтиля.ЦветТекстаФормы));
	ЭлементОформления.Использование = Истина;

	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления1 = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления2 = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления3 = ЭлементОформления.Поля.Элементы.Добавить();
	
	ПолеОформления.Поле= Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
	ПолеОформления1.Поле= Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковНомерСтроки");
	ПолеОформления2.Поле= Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаНачала");
	ПолеОформления3.Поле= Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаОкончания");
	
	ПолеОформления.Использование = Истина;
	ПолеОформления1.Использование = Истина;
	ПолеОформления2.Использование = Истина;
	ПолеОформления3.Использование = Истина;

КонецПроцедуры

#КонецОбласти