
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВКМ_ДобавитьДопРеквизитыНаФорму();
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ВМК_УстановитьВидимостьЭлементов(Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	Если Объект.ВидДоговора = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ВМК_УстановитьВидимостьЭлементов(Истина);
	Иначе
		ВМК_УстановитьВидимостьЭлементов(Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьДопРеквизитыНаФорму()

	ПолеПериодДействияНачало = Элементы.Добавить("ЭлементПериодДействияНачало", Тип("ПолеФормы"));
	ПолеПериодДействияНачало.Вид = ВидПоляФормы.ПолеВвода;
	ПолеПериодДействияНачало.ПутьКДанным = "Объект.ВКМ_ПериодДействияНачало";
	ПолеПериодДействияНачало.Видимость = Ложь;
	
	ПолеПериодДействияКонец = Элементы.Добавить("ЭлементПериодДействияКонец", Тип("ПолеФормы"));
	ПолеПериодДействияКонец.Вид = ВидПоляФормы.ПолеВвода;
	ПолеПериодДействияКонец.ПутьКДанным = "Объект.ВКМ_ПериодДействияКонец";
	ПолеПериодДействияКонец.Видимость = Ложь;
	
	ПолеСуммаАбонентскойПлаты = Элементы.Добавить("ЭлементСуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ПолеСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ПолеСуммаАбонентскойПлаты.Видимость = Ложь;
	
	ПолеСтоимостьЧасаРаботы = Элементы.Добавить("ЭлементСтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ПолеСтоимостьЧасаРаботы.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ВМК_УстановитьВидимостьЭлементов(ЗначениеВидимости)
	Элементы.ЭлементПериодДействияНачало.Видимость = ЗначениеВидимости;
	Элементы.ЭлементПериодДействияКонец.Видимость = ЗначениеВидимости;
	Элементы.ЭлементСуммаАбонентскойПлаты.Видимость = ЗначениеВидимости;
	Элементы.ЭлементСтоимостьЧасаРаботы.Видимость = ЗначениеВидимости;
КонецПроцедуры

#КонецОбласти