
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВКМ_ДобавитьДопРеквизитыНаФорму();
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ВМК_УстановитьВидимостьЭлементов(Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	Если Объект.ВидДоговора = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ВМК_УстановитьВидимостьЭлементов(Истина);
	Иначе
		ВМК_УстановитьВидимостьЭлементов(Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьДопРеквизитыНаФорму()

	ПолеПериодДействия = Элементы.Добавить("ЭлементПериодДействия", Тип("ПолеФормы"));
	ПолеПериодДействия.Вид = ВидПоляФормы.ПолеВвода;
	ПолеПериодДействия.ПутьКДанным = "Объект.ВКМ_ПериодДействия";
	ПолеПериодДействия.Видимость = Ложь;
	
	ПолеСуммаАбонентскойПлаты = Элементы.Добавить("ЭлементСуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ПолеСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ПолеСуммаАбонентскойПлаты.Видимость = Ложь;
	
	ПолеСтоимостьЧасаРаботы = Элементы.Добавить("ЭлементСтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ПолеСтоимостьЧасаРаботы.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ВМК_УстановитьВидимостьЭлементов(ЗначениеВидимости)
	Элементы.ЭлементПериодДействия.Видимость = ЗначениеВидимости;
	Элементы.ЭлементСуммаАбонентскойПлаты.Видимость = ЗначениеВидимости;
	Элементы.ЭлементСтоимостьЧасаРаботы.Видимость = ЗначениеВидимости;
КонецПроцедуры

#КонецОбласти