#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ТекстСообщения = "Не заполнен период.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Период", "Объект.Период", );
		Возврат;	
	КонецЕсли;
	
	Объект.СписокДоговоров.Очистить();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;

	ДлительнаяОперация = СоздатьРеализацииНаСервере();

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьРеализацииНаСервере()

	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
		"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьРеализацииПакетом", Объект.Период);

КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		СозданныеРеализации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если ЗначениеЗаполнено(СозданныеРеализации) Тогда
			Для Каждого ЭлМассива Из СозданныеРеализации Цикл
				НоваяСтрока = Объект.СписокДоговоров.Добавить();
				НоваяСтрока.Реализация = ЭлМассива["Реализация"];
				НоваяСтрока.Договор = ЭлМассива["Договор"];
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли